ExtensionUtility Property
 Property to check whether the instance can be extended and return the interface for extension operation.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public IExtension ExtensionUtility { get; }
  Visual Basic
Public ReadOnly Property ExtensionUtility As IExtension
	Get
  Visual C++
public:
property IExtension^ ExtensionUtility {
	IExtension^ get ();
}
 Remarks
 If the family instance can not support extension operation, it returns    a null reference (  Nothing  in Visual Basic)
 See Also
  FamilyInstance Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →